espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/interrupt_core1_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** CORE1_LP_RTC_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_LP_RTC_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x0)
/** CORE1_CORE1_LP_RTC_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_LP_RTC_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_LP_RTC_INT_MAP_M  (CORE1_CORE1_LP_RTC_INT_MAP_V << CORE1_CORE1_LP_RTC_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_LP_RTC_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_LP_RTC_INT_MAP_S  0
/** CORE1_CORE1_LP_RTC_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LP_RTC_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_LP_RTC_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_LP_RTC_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_LP_RTC_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_LP_RTC_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LP_RTC_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_LP_RTC_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LP_RTC_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_LP_RTC_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_LP_RTC_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_LP_RTC_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_LP_RTC_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LP_RTC_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_LP_WDT_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_LP_WDT_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x4)
/** CORE1_CORE1_LP_WDT_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_LP_WDT_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_LP_WDT_INT_MAP_M  (CORE1_CORE1_LP_WDT_INT_MAP_V << CORE1_CORE1_LP_WDT_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_LP_WDT_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_LP_WDT_INT_MAP_S  0
/** CORE1_CORE1_LP_WDT_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LP_WDT_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_LP_WDT_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_LP_WDT_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_LP_WDT_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_LP_WDT_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LP_WDT_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_LP_WDT_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LP_WDT_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_LP_WDT_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_LP_WDT_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_LP_WDT_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_LP_WDT_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LP_WDT_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_LP_TIMER_REG_0_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_LP_TIMER_REG_0_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x8)
/** CORE1_CORE1_LP_TIMER_REG_0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_LP_TIMER_REG_0_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_LP_TIMER_REG_0_INT_MAP_M  (CORE1_CORE1_LP_TIMER_REG_0_INT_MAP_V << CORE1_CORE1_LP_TIMER_REG_0_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_LP_TIMER_REG_0_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_LP_TIMER_REG_0_INT_MAP_S  0
/** CORE1_CORE1_LP_TIMER_REG_0_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LP_TIMER_REG_0_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_LP_TIMER_REG_0_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_LP_TIMER_REG_0_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_LP_TIMER_REG_0_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_LP_TIMER_REG_0_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LP_TIMER_REG_0_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_LP_TIMER_REG_0_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LP_TIMER_REG_0_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_LP_TIMER_REG_0_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_LP_TIMER_REG_0_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_LP_TIMER_REG_0_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_LP_TIMER_REG_0_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LP_TIMER_REG_0_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_LP_TIMER_REG_1_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_LP_TIMER_REG_1_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xc)
/** CORE1_CORE1_LP_TIMER_REG_1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_LP_TIMER_REG_1_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_LP_TIMER_REG_1_INT_MAP_M  (CORE1_CORE1_LP_TIMER_REG_1_INT_MAP_V << CORE1_CORE1_LP_TIMER_REG_1_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_LP_TIMER_REG_1_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_LP_TIMER_REG_1_INT_MAP_S  0
/** CORE1_CORE1_LP_TIMER_REG_1_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LP_TIMER_REG_1_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_LP_TIMER_REG_1_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_LP_TIMER_REG_1_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_LP_TIMER_REG_1_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_LP_TIMER_REG_1_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LP_TIMER_REG_1_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_LP_TIMER_REG_1_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LP_TIMER_REG_1_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_LP_TIMER_REG_1_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_LP_TIMER_REG_1_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_LP_TIMER_REG_1_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_LP_TIMER_REG_1_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LP_TIMER_REG_1_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_MB_HP_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_MB_HP_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x10)
/** CORE1_CORE1_MB_HP_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_MB_HP_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_MB_HP_INT_MAP_M  (CORE1_CORE1_MB_HP_INT_MAP_V << CORE1_CORE1_MB_HP_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_MB_HP_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_MB_HP_INT_MAP_S  0
/** CORE1_CORE1_MB_HP_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_MB_HP_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_MB_HP_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_MB_HP_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_MB_HP_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_MB_HP_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_MB_HP_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_MB_HP_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_MB_HP_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_MB_HP_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_MB_HP_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_MB_HP_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_MB_HP_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_MB_HP_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_MB_LP_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_MB_LP_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x14)
/** CORE1_CORE1_MB_LP_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_MB_LP_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_MB_LP_INT_MAP_M  (CORE1_CORE1_MB_LP_INT_MAP_V << CORE1_CORE1_MB_LP_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_MB_LP_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_MB_LP_INT_MAP_S  0
/** CORE1_CORE1_MB_LP_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_MB_LP_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_MB_LP_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_MB_LP_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_MB_LP_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_MB_LP_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_MB_LP_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_MB_LP_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_MB_LP_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_MB_LP_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_MB_LP_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_MB_LP_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_MB_LP_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_MB_LP_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_PMU_REG_0_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_PMU_REG_0_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x18)
/** CORE1_CORE1_PMU_REG_0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_PMU_REG_0_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_PMU_REG_0_INT_MAP_M  (CORE1_CORE1_PMU_REG_0_INT_MAP_V << CORE1_CORE1_PMU_REG_0_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_PMU_REG_0_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_PMU_REG_0_INT_MAP_S  0
/** CORE1_CORE1_PMU_REG_0_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_PMU_REG_0_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_PMU_REG_0_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_PMU_REG_0_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_PMU_REG_0_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_PMU_REG_0_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_PMU_REG_0_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_PMU_REG_0_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_PMU_REG_0_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_PMU_REG_0_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_PMU_REG_0_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_PMU_REG_0_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_PMU_REG_0_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_PMU_REG_0_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_PMU_REG_1_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_PMU_REG_1_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1c)
/** CORE1_CORE1_PMU_REG_1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_PMU_REG_1_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_PMU_REG_1_INT_MAP_M  (CORE1_CORE1_PMU_REG_1_INT_MAP_V << CORE1_CORE1_PMU_REG_1_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_PMU_REG_1_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_PMU_REG_1_INT_MAP_S  0
/** CORE1_CORE1_PMU_REG_1_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_PMU_REG_1_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_PMU_REG_1_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_PMU_REG_1_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_PMU_REG_1_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_PMU_REG_1_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_PMU_REG_1_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_PMU_REG_1_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_PMU_REG_1_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_PMU_REG_1_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_PMU_REG_1_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_PMU_REG_1_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_PMU_REG_1_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_PMU_REG_1_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_LP_ANAPERI_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_LP_ANAPERI_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x20)
/** CORE1_CORE1_LP_ANAPERI_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_LP_ANAPERI_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_LP_ANAPERI_INT_MAP_M  (CORE1_CORE1_LP_ANAPERI_INT_MAP_V << CORE1_CORE1_LP_ANAPERI_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_LP_ANAPERI_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_LP_ANAPERI_INT_MAP_S  0
/** CORE1_CORE1_LP_ANAPERI_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LP_ANAPERI_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_LP_ANAPERI_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_LP_ANAPERI_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_LP_ANAPERI_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_LP_ANAPERI_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LP_ANAPERI_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_LP_ANAPERI_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LP_ANAPERI_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_LP_ANAPERI_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_LP_ANAPERI_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_LP_ANAPERI_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_LP_ANAPERI_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LP_ANAPERI_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_LP_ADC_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_LP_ADC_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x24)
/** CORE1_CORE1_LP_ADC_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_LP_ADC_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_LP_ADC_INT_MAP_M  (CORE1_CORE1_LP_ADC_INT_MAP_V << CORE1_CORE1_LP_ADC_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_LP_ADC_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_LP_ADC_INT_MAP_S  0
/** CORE1_CORE1_LP_ADC_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LP_ADC_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_LP_ADC_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_LP_ADC_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_LP_ADC_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_LP_ADC_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LP_ADC_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_LP_ADC_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LP_ADC_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_LP_ADC_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_LP_ADC_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_LP_ADC_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_LP_ADC_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LP_ADC_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_LP_GPIO_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_LP_GPIO_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x28)
/** CORE1_CORE1_LP_GPIO_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_LP_GPIO_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_LP_GPIO_INT_MAP_M  (CORE1_CORE1_LP_GPIO_INT_MAP_V << CORE1_CORE1_LP_GPIO_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_LP_GPIO_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_LP_GPIO_INT_MAP_S  0
/** CORE1_CORE1_LP_GPIO_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LP_GPIO_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_LP_GPIO_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_LP_GPIO_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_LP_GPIO_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_LP_GPIO_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LP_GPIO_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_LP_GPIO_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LP_GPIO_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_LP_GPIO_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_LP_GPIO_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_LP_GPIO_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_LP_GPIO_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LP_GPIO_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_LP_I2C_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_LP_I2C_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x2c)
/** CORE1_CORE1_LP_I2C_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_LP_I2C_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_LP_I2C_INT_MAP_M  (CORE1_CORE1_LP_I2C_INT_MAP_V << CORE1_CORE1_LP_I2C_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_LP_I2C_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_LP_I2C_INT_MAP_S  0
/** CORE1_CORE1_LP_I2C_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LP_I2C_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_LP_I2C_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_LP_I2C_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_LP_I2C_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_LP_I2C_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LP_I2C_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_LP_I2C_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LP_I2C_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_LP_I2C_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_LP_I2C_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_LP_I2C_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_LP_I2C_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LP_I2C_INT_SRC_IN_SEC_FLAG_S  7

