espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/interrupt_core1_reg.h
/** CORE1_LP_I2S_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_LP_I2S_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x30)
/** CORE1_CORE1_LP_I2S_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_LP_I2S_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_LP_I2S_INT_MAP_M  (CORE1_CORE1_LP_I2S_INT_MAP_V << CORE1_CORE1_LP_I2S_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_LP_I2S_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_LP_I2S_INT_MAP_S  0
/** CORE1_CORE1_LP_I2S_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LP_I2S_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_LP_I2S_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_LP_I2S_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_LP_I2S_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_LP_I2S_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LP_I2S_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_LP_I2S_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LP_I2S_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_LP_I2S_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_LP_I2S_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_LP_I2S_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_LP_I2S_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LP_I2S_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_LP_SPI_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_LP_SPI_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x34)
/** CORE1_CORE1_LP_SPI_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_LP_SPI_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_LP_SPI_INT_MAP_M  (CORE1_CORE1_LP_SPI_INT_MAP_V << CORE1_CORE1_LP_SPI_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_LP_SPI_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_LP_SPI_INT_MAP_S  0
/** CORE1_CORE1_LP_SPI_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LP_SPI_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_LP_SPI_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_LP_SPI_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_LP_SPI_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_LP_SPI_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LP_SPI_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_LP_SPI_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LP_SPI_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_LP_SPI_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_LP_SPI_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_LP_SPI_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_LP_SPI_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LP_SPI_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_LP_TOUCH_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_LP_TOUCH_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x38)
/** CORE1_CORE1_LP_TOUCH_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_LP_TOUCH_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_LP_TOUCH_INT_MAP_M  (CORE1_CORE1_LP_TOUCH_INT_MAP_V << CORE1_CORE1_LP_TOUCH_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_LP_TOUCH_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_LP_TOUCH_INT_MAP_S  0
/** CORE1_CORE1_LP_TOUCH_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LP_TOUCH_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_LP_TOUCH_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_LP_TOUCH_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_LP_TOUCH_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_LP_TOUCH_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LP_TOUCH_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_LP_TOUCH_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LP_TOUCH_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_LP_TOUCH_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_LP_TOUCH_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_LP_TOUCH_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_LP_TOUCH_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LP_TOUCH_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_LP_TSENS_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_LP_TSENS_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x3c)
/** CORE1_CORE1_LP_TSENS_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_LP_TSENS_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_LP_TSENS_INT_MAP_M  (CORE1_CORE1_LP_TSENS_INT_MAP_V << CORE1_CORE1_LP_TSENS_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_LP_TSENS_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_LP_TSENS_INT_MAP_S  0
/** CORE1_CORE1_LP_TSENS_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LP_TSENS_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_LP_TSENS_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_LP_TSENS_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_LP_TSENS_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_LP_TSENS_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LP_TSENS_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_LP_TSENS_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LP_TSENS_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_LP_TSENS_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_LP_TSENS_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_LP_TSENS_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_LP_TSENS_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LP_TSENS_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_LP_UART_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_LP_UART_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x40)
/** CORE1_CORE1_LP_UART_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_LP_UART_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_LP_UART_INT_MAP_M  (CORE1_CORE1_LP_UART_INT_MAP_V << CORE1_CORE1_LP_UART_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_LP_UART_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_LP_UART_INT_MAP_S  0
/** CORE1_CORE1_LP_UART_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LP_UART_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_LP_UART_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_LP_UART_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_LP_UART_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_LP_UART_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LP_UART_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_LP_UART_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LP_UART_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_LP_UART_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_LP_UART_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_LP_UART_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_LP_UART_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LP_UART_INT_SRC_IN_SEC_FLAG_S  7

