espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/interrupt_core1_reg.h
/** CORE1_LP_EFUSE_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_LP_EFUSE_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x44)
/** CORE1_CORE1_LP_EFUSE_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_LP_EFUSE_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_LP_EFUSE_INT_MAP_M  (CORE1_CORE1_LP_EFUSE_INT_MAP_V << CORE1_CORE1_LP_EFUSE_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_LP_EFUSE_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_LP_EFUSE_INT_MAP_S  0
/** CORE1_CORE1_LP_EFUSE_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LP_EFUSE_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_LP_EFUSE_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_LP_EFUSE_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_LP_EFUSE_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_LP_EFUSE_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LP_EFUSE_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_LP_EFUSE_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LP_EFUSE_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_LP_EFUSE_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_LP_EFUSE_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_LP_EFUSE_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_LP_EFUSE_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LP_EFUSE_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_LP_SW_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_LP_SW_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x48)
/** CORE1_CORE1_LP_SW_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_LP_SW_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_LP_SW_INT_MAP_M  (CORE1_CORE1_LP_SW_INT_MAP_V << CORE1_CORE1_LP_SW_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_LP_SW_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_LP_SW_INT_MAP_S  0
/** CORE1_CORE1_LP_SW_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LP_SW_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_LP_SW_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_LP_SW_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_LP_SW_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_LP_SW_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LP_SW_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_LP_SW_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LP_SW_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_LP_SW_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_LP_SW_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_LP_SW_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_LP_SW_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LP_SW_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_LP_SYSREG_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_LP_SYSREG_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x4c)
/** CORE1_CORE1_LP_SYSREG_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_LP_SYSREG_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_LP_SYSREG_INT_MAP_M  (CORE1_CORE1_LP_SYSREG_INT_MAP_V << CORE1_CORE1_LP_SYSREG_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_LP_SYSREG_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_LP_SYSREG_INT_MAP_S  0
/** CORE1_CORE1_LP_SYSREG_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LP_SYSREG_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_LP_SYSREG_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_LP_SYSREG_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_LP_SYSREG_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_LP_SYSREG_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LP_SYSREG_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_LP_SYSREG_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LP_SYSREG_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_LP_SYSREG_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_LP_SYSREG_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_LP_SYSREG_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_LP_SYSREG_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LP_SYSREG_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_LP_HUK_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_LP_HUK_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x50)
/** CORE1_CORE1_LP_HUK_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_LP_HUK_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_LP_HUK_INT_MAP_M  (CORE1_CORE1_LP_HUK_INT_MAP_V << CORE1_CORE1_LP_HUK_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_LP_HUK_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_LP_HUK_INT_MAP_S  0
/** CORE1_CORE1_LP_HUK_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LP_HUK_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_LP_HUK_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_LP_HUK_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_LP_HUK_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_LP_HUK_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LP_HUK_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_LP_HUK_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LP_HUK_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_LP_HUK_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_LP_HUK_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_LP_HUK_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_LP_HUK_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LP_HUK_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_SYS_ICM_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_SYS_ICM_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x54)
/** CORE1_CORE1_SYS_ICM_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_SYS_ICM_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_SYS_ICM_INT_MAP_M  (CORE1_CORE1_SYS_ICM_INT_MAP_V << CORE1_CORE1_SYS_ICM_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_SYS_ICM_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_SYS_ICM_INT_MAP_S  0
/** CORE1_CORE1_SYS_ICM_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_SYS_ICM_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_SYS_ICM_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_SYS_ICM_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_SYS_ICM_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_SYS_ICM_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_SYS_ICM_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_SYS_ICM_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_SYS_ICM_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_SYS_ICM_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_SYS_ICM_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_SYS_ICM_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_SYS_ICM_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_SYS_ICM_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_USB_DEVICE_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_USB_DEVICE_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x58)
/** CORE1_CORE1_USB_DEVICE_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_USB_DEVICE_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_USB_DEVICE_INT_MAP_M  (CORE1_CORE1_USB_DEVICE_INT_MAP_V << CORE1_CORE1_USB_DEVICE_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_USB_DEVICE_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_USB_DEVICE_INT_MAP_S  0
/** CORE1_CORE1_USB_DEVICE_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_USB_DEVICE_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_USB_DEVICE_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_USB_DEVICE_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_USB_DEVICE_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_USB_DEVICE_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_USB_DEVICE_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_USB_DEVICE_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_USB_DEVICE_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_USB_DEVICE_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_USB_DEVICE_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_USB_DEVICE_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_USB_DEVICE_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_USB_DEVICE_INT_SRC_IN_SEC_FLAG_S  7

