espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/interrupt_core1_reg.h
/** CORE1_SDIO_HOST_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_SDIO_HOST_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x5c)
/** CORE1_CORE1_SDIO_HOST_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_SDIO_HOST_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_SDIO_HOST_INT_MAP_M  (CORE1_CORE1_SDIO_HOST_INT_MAP_V << CORE1_CORE1_SDIO_HOST_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_SDIO_HOST_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_SDIO_HOST_INT_MAP_S  0
/** CORE1_CORE1_SDIO_HOST_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_SDIO_HOST_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_SDIO_HOST_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_SDIO_HOST_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_SDIO_HOST_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_SDIO_HOST_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_SDIO_HOST_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_SDIO_HOST_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_SDIO_HOST_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_SDIO_HOST_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_SDIO_HOST_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_SDIO_HOST_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_SDIO_HOST_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_SDIO_HOST_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_GDMA_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_GDMA_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x60)
/** CORE1_CORE1_GDMA_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_GDMA_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_GDMA_INT_MAP_M  (CORE1_CORE1_GDMA_INT_MAP_V << CORE1_CORE1_GDMA_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_GDMA_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_GDMA_INT_MAP_S  0
/** CORE1_CORE1_GDMA_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_GDMA_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_GDMA_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_GDMA_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_GDMA_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_GDMA_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_GDMA_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_GDMA_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_GDMA_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_GDMA_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_GDMA_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_GDMA_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_GDMA_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_GDMA_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_SPI2_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_SPI2_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x64)
/** CORE1_CORE1_SPI2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_SPI2_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_SPI2_INT_MAP_M  (CORE1_CORE1_SPI2_INT_MAP_V << CORE1_CORE1_SPI2_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_SPI2_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_SPI2_INT_MAP_S  0
/** CORE1_CORE1_SPI2_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_SPI2_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_SPI2_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_SPI2_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_SPI2_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_SPI2_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_SPI2_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_SPI2_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_SPI2_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_SPI2_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_SPI2_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_SPI2_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_SPI2_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_SPI2_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_SPI3_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_SPI3_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x68)
/** CORE1_CORE1_SPI3_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_SPI3_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_SPI3_INT_MAP_M  (CORE1_CORE1_SPI3_INT_MAP_V << CORE1_CORE1_SPI3_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_SPI3_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_SPI3_INT_MAP_S  0
/** CORE1_CORE1_SPI3_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_SPI3_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_SPI3_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_SPI3_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_SPI3_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_SPI3_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_SPI3_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_SPI3_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_SPI3_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_SPI3_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_SPI3_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_SPI3_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_SPI3_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_SPI3_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_I2S0_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_I2S0_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x6c)
/** CORE1_CORE1_I2S0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_I2S0_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_I2S0_INT_MAP_M  (CORE1_CORE1_I2S0_INT_MAP_V << CORE1_CORE1_I2S0_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_I2S0_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_I2S0_INT_MAP_S  0
/** CORE1_CORE1_I2S0_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_I2S0_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_I2S0_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_I2S0_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_I2S0_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_I2S0_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_I2S0_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_I2S0_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_I2S0_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_I2S0_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_I2S0_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_I2S0_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_I2S0_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_I2S0_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_I2S1_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_I2S1_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x70)
/** CORE1_CORE1_I2S1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_I2S1_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_I2S1_INT_MAP_M  (CORE1_CORE1_I2S1_INT_MAP_V << CORE1_CORE1_I2S1_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_I2S1_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_I2S1_INT_MAP_S  0
/** CORE1_CORE1_I2S1_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_I2S1_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_I2S1_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_I2S1_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_I2S1_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_I2S1_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_I2S1_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_I2S1_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_I2S1_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_I2S1_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_I2S1_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_I2S1_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_I2S1_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_I2S1_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_I2S2_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_I2S2_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x74)
/** CORE1_CORE1_I2S2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_I2S2_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_I2S2_INT_MAP_M  (CORE1_CORE1_I2S2_INT_MAP_V << CORE1_CORE1_I2S2_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_I2S2_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_I2S2_INT_MAP_S  0
/** CORE1_CORE1_I2S2_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_I2S2_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_I2S2_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_I2S2_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_I2S2_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_I2S2_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_I2S2_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_I2S2_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_I2S2_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_I2S2_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_I2S2_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_I2S2_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_I2S2_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_I2S2_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_UHCI0_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_UHCI0_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x78)
/** CORE1_CORE1_UHCI0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_UHCI0_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_UHCI0_INT_MAP_M  (CORE1_CORE1_UHCI0_INT_MAP_V << CORE1_CORE1_UHCI0_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_UHCI0_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_UHCI0_INT_MAP_S  0
/** CORE1_CORE1_UHCI0_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_UHCI0_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_UHCI0_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_UHCI0_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_UHCI0_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_UHCI0_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_UHCI0_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_UHCI0_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_UHCI0_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_UHCI0_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_UHCI0_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_UHCI0_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_UHCI0_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_UHCI0_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_UART0_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_UART0_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x7c)
/** CORE1_CORE1_UART0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_UART0_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_UART0_INT_MAP_M  (CORE1_CORE1_UART0_INT_MAP_V << CORE1_CORE1_UART0_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_UART0_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_UART0_INT_MAP_S  0
/** CORE1_CORE1_UART0_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_UART0_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_UART0_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_UART0_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_UART0_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_UART0_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_UART0_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_UART0_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_UART0_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_UART0_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_UART0_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_UART0_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_UART0_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_UART0_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_UART1_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_UART1_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x80)
/** CORE1_CORE1_UART1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_UART1_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_UART1_INT_MAP_M  (CORE1_CORE1_UART1_INT_MAP_V << CORE1_CORE1_UART1_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_UART1_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_UART1_INT_MAP_S  0
/** CORE1_CORE1_UART1_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_UART1_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_UART1_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_UART1_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_UART1_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_UART1_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_UART1_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_UART1_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_UART1_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_UART1_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_UART1_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_UART1_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_UART1_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_UART1_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_UART2_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_UART2_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x84)
/** CORE1_CORE1_UART2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_UART2_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_UART2_INT_MAP_M  (CORE1_CORE1_UART2_INT_MAP_V << CORE1_CORE1_UART2_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_UART2_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_UART2_INT_MAP_S  0
/** CORE1_CORE1_UART2_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_UART2_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_UART2_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_UART2_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_UART2_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_UART2_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_UART2_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_UART2_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_UART2_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_UART2_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_UART2_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_UART2_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_UART2_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_UART2_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_UART3_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_UART3_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x88)
/** CORE1_CORE1_UART3_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_UART3_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_UART3_INT_MAP_M  (CORE1_CORE1_UART3_INT_MAP_V << CORE1_CORE1_UART3_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_UART3_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_UART3_INT_MAP_S  0
/** CORE1_CORE1_UART3_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_UART3_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_UART3_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_UART3_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_UART3_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_UART3_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_UART3_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_UART3_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_UART3_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_UART3_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_UART3_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_UART3_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_UART3_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_UART3_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_UART4_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_UART4_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x8c)
/** CORE1_CORE1_UART4_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_UART4_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_UART4_INT_MAP_M  (CORE1_CORE1_UART4_INT_MAP_V << CORE1_CORE1_UART4_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_UART4_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_UART4_INT_MAP_S  0
/** CORE1_CORE1_UART4_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_UART4_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_UART4_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_UART4_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_UART4_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_UART4_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_UART4_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_UART4_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_UART4_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_UART4_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_UART4_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_UART4_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_UART4_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_UART4_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_LCD_CAM_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_LCD_CAM_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x90)
/** CORE1_CORE1_LCD_CAM_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_LCD_CAM_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_LCD_CAM_INT_MAP_M  (CORE1_CORE1_LCD_CAM_INT_MAP_V << CORE1_CORE1_LCD_CAM_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_LCD_CAM_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_LCD_CAM_INT_MAP_S  0
/** CORE1_CORE1_LCD_CAM_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LCD_CAM_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_LCD_CAM_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_LCD_CAM_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_LCD_CAM_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_LCD_CAM_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LCD_CAM_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_LCD_CAM_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LCD_CAM_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_LCD_CAM_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_LCD_CAM_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_LCD_CAM_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_LCD_CAM_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LCD_CAM_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_ADC_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_ADC_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x94)
/** CORE1_CORE1_ADC_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_ADC_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_ADC_INT_MAP_M  (CORE1_CORE1_ADC_INT_MAP_V << CORE1_CORE1_ADC_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_ADC_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_ADC_INT_MAP_S  0
/** CORE1_CORE1_ADC_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_ADC_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_ADC_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_ADC_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_ADC_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_ADC_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_ADC_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_ADC_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_ADC_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_ADC_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_ADC_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_ADC_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_ADC_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_ADC_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_PWM0_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_PWM0_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x98)
/** CORE1_CORE1_PWM0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_PWM0_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_PWM0_INT_MAP_M  (CORE1_CORE1_PWM0_INT_MAP_V << CORE1_CORE1_PWM0_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_PWM0_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_PWM0_INT_MAP_S  0
/** CORE1_CORE1_PWM0_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_PWM0_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_PWM0_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_PWM0_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_PWM0_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_PWM0_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_PWM0_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_PWM0_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_PWM0_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_PWM0_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_PWM0_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_PWM0_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_PWM0_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_PWM0_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_PWM1_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_PWM1_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x9c)
/** CORE1_CORE1_PWM1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_PWM1_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_PWM1_INT_MAP_M  (CORE1_CORE1_PWM1_INT_MAP_V << CORE1_CORE1_PWM1_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_PWM1_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_PWM1_INT_MAP_S  0
/** CORE1_CORE1_PWM1_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_PWM1_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_PWM1_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_PWM1_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_PWM1_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_PWM1_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_PWM1_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_PWM1_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_PWM1_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_PWM1_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_PWM1_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_PWM1_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_PWM1_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_PWM1_INT_SRC_IN_SEC_FLAG_S  7

