espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/interrupt_core1_reg.h
/** CORE1_TIMERGRP0_WDT_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_TIMERGRP0_WDT_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xc0)
/** CORE1_CORE1_TIMERGRP0_WDT_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_TIMERGRP0_WDT_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_TIMERGRP0_WDT_INT_MAP_M  (CORE1_CORE1_TIMERGRP0_WDT_INT_MAP_V << CORE1_CORE1_TIMERGRP0_WDT_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_TIMERGRP0_WDT_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_TIMERGRP0_WDT_INT_MAP_S  0
/** CORE1_CORE1_TIMERGRP0_WDT_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_TIMERGRP0_WDT_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_TIMERGRP0_WDT_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_TIMERGRP0_WDT_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_TIMERGRP0_WDT_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_TIMERGRP0_WDT_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_TIMERGRP0_WDT_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_TIMERGRP0_WDT_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_TIMERGRP0_WDT_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_TIMERGRP0_WDT_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_TIMERGRP0_WDT_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_TIMERGRP0_WDT_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_TIMERGRP0_WDT_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_TIMERGRP0_WDT_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_TIMERGRP1_T0_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_TIMERGRP1_T0_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xc4)
/** CORE1_CORE1_TIMERGRP1_T0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_TIMERGRP1_T0_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_TIMERGRP1_T0_INT_MAP_M  (CORE1_CORE1_TIMERGRP1_T0_INT_MAP_V << CORE1_CORE1_TIMERGRP1_T0_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_TIMERGRP1_T0_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_TIMERGRP1_T0_INT_MAP_S  0
/** CORE1_CORE1_TIMERGRP1_T0_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_TIMERGRP1_T0_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_TIMERGRP1_T0_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_TIMERGRP1_T0_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_TIMERGRP1_T0_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_TIMERGRP1_T0_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_TIMERGRP1_T0_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_TIMERGRP1_T0_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_TIMERGRP1_T0_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_TIMERGRP1_T0_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_TIMERGRP1_T0_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_TIMERGRP1_T0_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_TIMERGRP1_T0_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_TIMERGRP1_T0_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_TIMERGRP1_T1_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_TIMERGRP1_T1_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xc8)
/** CORE1_CORE1_TIMERGRP1_T1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_TIMERGRP1_T1_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_TIMERGRP1_T1_INT_MAP_M  (CORE1_CORE1_TIMERGRP1_T1_INT_MAP_V << CORE1_CORE1_TIMERGRP1_T1_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_TIMERGRP1_T1_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_TIMERGRP1_T1_INT_MAP_S  0
/** CORE1_CORE1_TIMERGRP1_T1_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_TIMERGRP1_T1_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_TIMERGRP1_T1_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_TIMERGRP1_T1_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_TIMERGRP1_T1_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_TIMERGRP1_T1_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_TIMERGRP1_T1_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_TIMERGRP1_T1_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_TIMERGRP1_T1_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_TIMERGRP1_T1_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_TIMERGRP1_T1_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_TIMERGRP1_T1_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_TIMERGRP1_T1_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_TIMERGRP1_T1_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_TIMERGRP1_WDT_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_TIMERGRP1_WDT_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xcc)
/** CORE1_CORE1_TIMERGRP1_WDT_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_TIMERGRP1_WDT_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_TIMERGRP1_WDT_INT_MAP_M  (CORE1_CORE1_TIMERGRP1_WDT_INT_MAP_V << CORE1_CORE1_TIMERGRP1_WDT_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_TIMERGRP1_WDT_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_TIMERGRP1_WDT_INT_MAP_S  0
/** CORE1_CORE1_TIMERGRP1_WDT_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_TIMERGRP1_WDT_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_TIMERGRP1_WDT_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_TIMERGRP1_WDT_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_TIMERGRP1_WDT_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_TIMERGRP1_WDT_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_TIMERGRP1_WDT_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_TIMERGRP1_WDT_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_TIMERGRP1_WDT_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_TIMERGRP1_WDT_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_TIMERGRP1_WDT_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_TIMERGRP1_WDT_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_TIMERGRP1_WDT_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_TIMERGRP1_WDT_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_LEDC_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_LEDC_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xd0)
/** CORE1_CORE1_LEDC_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_LEDC_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_LEDC_INT_MAP_M  (CORE1_CORE1_LEDC_INT_MAP_V << CORE1_CORE1_LEDC_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_LEDC_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_LEDC_INT_MAP_S  0
/** CORE1_CORE1_LEDC_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LEDC_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_LEDC_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_LEDC_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_LEDC_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_LEDC_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LEDC_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_LEDC_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_LEDC_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_LEDC_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_LEDC_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_LEDC_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_LEDC_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_LEDC_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_SYSTIMER_TARGET0_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_SYSTIMER_TARGET0_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xd4)
/** CORE1_CORE1_SYSTIMER_TARGET0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_SYSTIMER_TARGET0_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_SYSTIMER_TARGET0_INT_MAP_M  (CORE1_CORE1_SYSTIMER_TARGET0_INT_MAP_V << CORE1_CORE1_SYSTIMER_TARGET0_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_SYSTIMER_TARGET0_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_SYSTIMER_TARGET0_INT_MAP_S  0
/** CORE1_CORE1_SYSTIMER_TARGET0_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_SYSTIMER_TARGET0_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_SYSTIMER_TARGET0_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_SYSTIMER_TARGET0_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_SYSTIMER_TARGET0_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_SYSTIMER_TARGET0_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_SYSTIMER_TARGET0_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_SYSTIMER_TARGET0_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_SYSTIMER_TARGET0_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_SYSTIMER_TARGET0_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_SYSTIMER_TARGET0_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_SYSTIMER_TARGET0_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_SYSTIMER_TARGET0_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_SYSTIMER_TARGET0_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_SYSTIMER_TARGET1_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_SYSTIMER_TARGET1_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xd8)
/** CORE1_CORE1_SYSTIMER_TARGET1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_SYSTIMER_TARGET1_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_SYSTIMER_TARGET1_INT_MAP_M  (CORE1_CORE1_SYSTIMER_TARGET1_INT_MAP_V << CORE1_CORE1_SYSTIMER_TARGET1_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_SYSTIMER_TARGET1_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_SYSTIMER_TARGET1_INT_MAP_S  0
/** CORE1_CORE1_SYSTIMER_TARGET1_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_SYSTIMER_TARGET1_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_SYSTIMER_TARGET1_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_SYSTIMER_TARGET1_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_SYSTIMER_TARGET1_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_SYSTIMER_TARGET1_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_SYSTIMER_TARGET1_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_SYSTIMER_TARGET1_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_SYSTIMER_TARGET1_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_SYSTIMER_TARGET1_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_SYSTIMER_TARGET1_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_SYSTIMER_TARGET1_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_SYSTIMER_TARGET1_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_SYSTIMER_TARGET1_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_SYSTIMER_TARGET2_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_SYSTIMER_TARGET2_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xdc)
/** CORE1_CORE1_SYSTIMER_TARGET2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_SYSTIMER_TARGET2_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_SYSTIMER_TARGET2_INT_MAP_M  (CORE1_CORE1_SYSTIMER_TARGET2_INT_MAP_V << CORE1_CORE1_SYSTIMER_TARGET2_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_SYSTIMER_TARGET2_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_SYSTIMER_TARGET2_INT_MAP_S  0
/** CORE1_CORE1_SYSTIMER_TARGET2_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_SYSTIMER_TARGET2_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_SYSTIMER_TARGET2_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_SYSTIMER_TARGET2_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_SYSTIMER_TARGET2_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_SYSTIMER_TARGET2_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_SYSTIMER_TARGET2_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_SYSTIMER_TARGET2_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_SYSTIMER_TARGET2_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_SYSTIMER_TARGET2_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_SYSTIMER_TARGET2_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_SYSTIMER_TARGET2_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_SYSTIMER_TARGET2_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_SYSTIMER_TARGET2_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_AHB_PDMA_IN_CH0_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_AHB_PDMA_IN_CH0_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xe0)
/** CORE1_CORE1_AHB_PDMA_IN_CH0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_IN_CH0_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_IN_CH0_INT_MAP_M  (CORE1_CORE1_AHB_PDMA_IN_CH0_INT_MAP_V << CORE1_CORE1_AHB_PDMA_IN_CH0_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_IN_CH0_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_IN_CH0_INT_MAP_S  0
/** CORE1_CORE1_AHB_PDMA_IN_CH0_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_IN_CH0_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_IN_CH0_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_AHB_PDMA_IN_CH0_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_AHB_PDMA_IN_CH0_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_IN_CH0_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_IN_CH0_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_AHB_PDMA_IN_CH0_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_IN_CH0_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_IN_CH0_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_AHB_PDMA_IN_CH0_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_AHB_PDMA_IN_CH0_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_IN_CH0_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_IN_CH0_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_AHB_PDMA_IN_CH1_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_AHB_PDMA_IN_CH1_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xe4)
/** CORE1_CORE1_AHB_PDMA_IN_CH1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_IN_CH1_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_IN_CH1_INT_MAP_M  (CORE1_CORE1_AHB_PDMA_IN_CH1_INT_MAP_V << CORE1_CORE1_AHB_PDMA_IN_CH1_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_IN_CH1_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_IN_CH1_INT_MAP_S  0
/** CORE1_CORE1_AHB_PDMA_IN_CH1_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_IN_CH1_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_IN_CH1_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_AHB_PDMA_IN_CH1_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_AHB_PDMA_IN_CH1_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_IN_CH1_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_IN_CH1_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_AHB_PDMA_IN_CH1_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_IN_CH1_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_IN_CH1_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_AHB_PDMA_IN_CH1_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_AHB_PDMA_IN_CH1_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_IN_CH1_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_IN_CH1_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_AHB_PDMA_IN_CH2_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_AHB_PDMA_IN_CH2_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xe8)
/** CORE1_CORE1_AHB_PDMA_IN_CH2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_IN_CH2_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_IN_CH2_INT_MAP_M  (CORE1_CORE1_AHB_PDMA_IN_CH2_INT_MAP_V << CORE1_CORE1_AHB_PDMA_IN_CH2_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_IN_CH2_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_IN_CH2_INT_MAP_S  0
/** CORE1_CORE1_AHB_PDMA_IN_CH2_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_IN_CH2_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_IN_CH2_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_AHB_PDMA_IN_CH2_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_AHB_PDMA_IN_CH2_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_IN_CH2_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_IN_CH2_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_AHB_PDMA_IN_CH2_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_IN_CH2_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_IN_CH2_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_AHB_PDMA_IN_CH2_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_AHB_PDMA_IN_CH2_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_IN_CH2_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_IN_CH2_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_AHB_PDMA_OUT_CH0_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH0_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xec)
/** CORE1_CORE1_AHB_PDMA_OUT_CH0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_OUT_CH0_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_OUT_CH0_INT_MAP_M  (CORE1_CORE1_AHB_PDMA_OUT_CH0_INT_MAP_V << CORE1_CORE1_AHB_PDMA_OUT_CH0_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_OUT_CH0_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_OUT_CH0_INT_MAP_S  0
/** CORE1_CORE1_AHB_PDMA_OUT_CH0_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_OUT_CH0_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_OUT_CH0_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_AHB_PDMA_OUT_CH0_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_AHB_PDMA_OUT_CH0_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_OUT_CH0_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_OUT_CH0_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_AHB_PDMA_OUT_CH0_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_OUT_CH0_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_OUT_CH0_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_AHB_PDMA_OUT_CH0_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_AHB_PDMA_OUT_CH0_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_OUT_CH0_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_OUT_CH0_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_AHB_PDMA_OUT_CH1_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH1_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xf0)
/** CORE1_CORE1_AHB_PDMA_OUT_CH1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_OUT_CH1_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_OUT_CH1_INT_MAP_M  (CORE1_CORE1_AHB_PDMA_OUT_CH1_INT_MAP_V << CORE1_CORE1_AHB_PDMA_OUT_CH1_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_OUT_CH1_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_OUT_CH1_INT_MAP_S  0
/** CORE1_CORE1_AHB_PDMA_OUT_CH1_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_OUT_CH1_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_OUT_CH1_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_AHB_PDMA_OUT_CH1_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_AHB_PDMA_OUT_CH1_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_OUT_CH1_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_OUT_CH1_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_AHB_PDMA_OUT_CH1_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_OUT_CH1_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_OUT_CH1_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_AHB_PDMA_OUT_CH1_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_AHB_PDMA_OUT_CH1_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_OUT_CH1_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_OUT_CH1_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_AHB_PDMA_OUT_CH2_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH2_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xf4)
/** CORE1_CORE1_AHB_PDMA_OUT_CH2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_OUT_CH2_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_OUT_CH2_INT_MAP_M  (CORE1_CORE1_AHB_PDMA_OUT_CH2_INT_MAP_V << CORE1_CORE1_AHB_PDMA_OUT_CH2_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_OUT_CH2_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_OUT_CH2_INT_MAP_S  0
/** CORE1_CORE1_AHB_PDMA_OUT_CH2_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_OUT_CH2_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_OUT_CH2_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_AHB_PDMA_OUT_CH2_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_AHB_PDMA_OUT_CH2_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_OUT_CH2_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_OUT_CH2_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_AHB_PDMA_OUT_CH2_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_OUT_CH2_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_OUT_CH2_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_AHB_PDMA_OUT_CH2_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_AHB_PDMA_OUT_CH2_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_OUT_CH2_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_AHB_PDMA_OUT_CH2_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_AXI_PDMA_IN_CH0_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_AXI_PDMA_IN_CH0_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xf8)
/** CORE1_CORE1_AXI_PDMA_IN_CH0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_IN_CH0_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_IN_CH0_INT_MAP_M  (CORE1_CORE1_AXI_PDMA_IN_CH0_INT_MAP_V << CORE1_CORE1_AXI_PDMA_IN_CH0_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_IN_CH0_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_IN_CH0_INT_MAP_S  0
/** CORE1_CORE1_AXI_PDMA_IN_CH0_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_IN_CH0_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_IN_CH0_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_AXI_PDMA_IN_CH0_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_AXI_PDMA_IN_CH0_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_IN_CH0_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_IN_CH0_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_AXI_PDMA_IN_CH0_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_IN_CH0_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_IN_CH0_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_AXI_PDMA_IN_CH0_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_AXI_PDMA_IN_CH0_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_IN_CH0_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_IN_CH0_INT_SRC_IN_SEC_FLAG_S  7

