espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/interrupt_core1_reg.h
/** CORE1_AXI_PDMA_IN_CH1_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_AXI_PDMA_IN_CH1_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xfc)
/** CORE1_CORE1_AXI_PDMA_IN_CH1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_IN_CH1_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_IN_CH1_INT_MAP_M  (CORE1_CORE1_AXI_PDMA_IN_CH1_INT_MAP_V << CORE1_CORE1_AXI_PDMA_IN_CH1_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_IN_CH1_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_IN_CH1_INT_MAP_S  0
/** CORE1_CORE1_AXI_PDMA_IN_CH1_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_IN_CH1_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_IN_CH1_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_AXI_PDMA_IN_CH1_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_AXI_PDMA_IN_CH1_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_IN_CH1_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_IN_CH1_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_AXI_PDMA_IN_CH1_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_IN_CH1_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_IN_CH1_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_AXI_PDMA_IN_CH1_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_AXI_PDMA_IN_CH1_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_IN_CH1_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_IN_CH1_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_AXI_PDMA_IN_CH2_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_AXI_PDMA_IN_CH2_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x100)
/** CORE1_CORE1_AXI_PDMA_IN_CH2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_IN_CH2_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_IN_CH2_INT_MAP_M  (CORE1_CORE1_AXI_PDMA_IN_CH2_INT_MAP_V << CORE1_CORE1_AXI_PDMA_IN_CH2_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_IN_CH2_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_IN_CH2_INT_MAP_S  0
/** CORE1_CORE1_AXI_PDMA_IN_CH2_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_IN_CH2_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_IN_CH2_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_AXI_PDMA_IN_CH2_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_AXI_PDMA_IN_CH2_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_IN_CH2_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_IN_CH2_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_AXI_PDMA_IN_CH2_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_IN_CH2_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_IN_CH2_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_AXI_PDMA_IN_CH2_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_AXI_PDMA_IN_CH2_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_IN_CH2_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_IN_CH2_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_AXI_PDMA_OUT_CH0_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_AXI_PDMA_OUT_CH0_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x104)
/** CORE1_CORE1_AXI_PDMA_OUT_CH0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_OUT_CH0_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_OUT_CH0_INT_MAP_M  (CORE1_CORE1_AXI_PDMA_OUT_CH0_INT_MAP_V << CORE1_CORE1_AXI_PDMA_OUT_CH0_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_OUT_CH0_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_OUT_CH0_INT_MAP_S  0
/** CORE1_CORE1_AXI_PDMA_OUT_CH0_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_OUT_CH0_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_OUT_CH0_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_AXI_PDMA_OUT_CH0_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_AXI_PDMA_OUT_CH0_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_OUT_CH0_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_OUT_CH0_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_AXI_PDMA_OUT_CH0_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_OUT_CH0_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_OUT_CH0_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_AXI_PDMA_OUT_CH0_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_AXI_PDMA_OUT_CH0_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_OUT_CH0_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_OUT_CH0_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_AXI_PDMA_OUT_CH1_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_AXI_PDMA_OUT_CH1_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x108)
/** CORE1_CORE1_AXI_PDMA_OUT_CH1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_OUT_CH1_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_OUT_CH1_INT_MAP_M  (CORE1_CORE1_AXI_PDMA_OUT_CH1_INT_MAP_V << CORE1_CORE1_AXI_PDMA_OUT_CH1_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_OUT_CH1_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_OUT_CH1_INT_MAP_S  0
/** CORE1_CORE1_AXI_PDMA_OUT_CH1_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_OUT_CH1_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_OUT_CH1_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_AXI_PDMA_OUT_CH1_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_AXI_PDMA_OUT_CH1_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_OUT_CH1_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_OUT_CH1_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_AXI_PDMA_OUT_CH1_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_OUT_CH1_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_OUT_CH1_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_AXI_PDMA_OUT_CH1_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_AXI_PDMA_OUT_CH1_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_OUT_CH1_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_OUT_CH1_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_AXI_PDMA_OUT_CH2_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_AXI_PDMA_OUT_CH2_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x10c)
/** CORE1_CORE1_AXI_PDMA_OUT_CH2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_OUT_CH2_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_OUT_CH2_INT_MAP_M  (CORE1_CORE1_AXI_PDMA_OUT_CH2_INT_MAP_V << CORE1_CORE1_AXI_PDMA_OUT_CH2_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_OUT_CH2_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_OUT_CH2_INT_MAP_S  0
/** CORE1_CORE1_AXI_PDMA_OUT_CH2_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_OUT_CH2_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_OUT_CH2_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_AXI_PDMA_OUT_CH2_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_AXI_PDMA_OUT_CH2_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_OUT_CH2_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_OUT_CH2_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_AXI_PDMA_OUT_CH2_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_OUT_CH2_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_OUT_CH2_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_AXI_PDMA_OUT_CH2_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_AXI_PDMA_OUT_CH2_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_OUT_CH2_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_AXI_PDMA_OUT_CH2_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_RSA_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_RSA_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x110)
/** CORE1_CORE1_RSA_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_RSA_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_RSA_INT_MAP_M  (CORE1_CORE1_RSA_INT_MAP_V << CORE1_CORE1_RSA_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_RSA_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_RSA_INT_MAP_S  0
/** CORE1_CORE1_RSA_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_RSA_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_RSA_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_RSA_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_RSA_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_RSA_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_RSA_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_RSA_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_RSA_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_RSA_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_RSA_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_RSA_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_RSA_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_RSA_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_AES_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_AES_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x114)
/** CORE1_CORE1_AES_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_AES_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_AES_INT_MAP_M  (CORE1_CORE1_AES_INT_MAP_V << CORE1_CORE1_AES_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_AES_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_AES_INT_MAP_S  0
/** CORE1_CORE1_AES_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_AES_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_AES_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_AES_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_AES_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_AES_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_AES_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_AES_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_AES_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_AES_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_AES_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_AES_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_AES_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_AES_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_SHA_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_SHA_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x118)
/** CORE1_CORE1_SHA_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_SHA_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_SHA_INT_MAP_M  (CORE1_CORE1_SHA_INT_MAP_V << CORE1_CORE1_SHA_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_SHA_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_SHA_INT_MAP_S  0
/** CORE1_CORE1_SHA_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_SHA_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_SHA_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_SHA_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_SHA_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_SHA_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_SHA_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_SHA_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_SHA_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_SHA_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_SHA_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_SHA_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_SHA_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_SHA_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_ECC_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_ECC_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x11c)
/** CORE1_CORE1_ECC_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_ECC_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_ECC_INT_MAP_M  (CORE1_CORE1_ECC_INT_MAP_V << CORE1_CORE1_ECC_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_ECC_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_ECC_INT_MAP_S  0
/** CORE1_CORE1_ECC_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_ECC_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_ECC_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_ECC_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_ECC_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_ECC_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_ECC_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_ECC_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_ECC_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_ECC_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_ECC_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_ECC_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_ECC_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_ECC_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_ECDSA_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_ECDSA_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x120)
/** CORE1_CORE1_ECDSA_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_ECDSA_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_ECDSA_INT_MAP_M  (CORE1_CORE1_ECDSA_INT_MAP_V << CORE1_CORE1_ECDSA_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_ECDSA_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_ECDSA_INT_MAP_S  0
/** CORE1_CORE1_ECDSA_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_ECDSA_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_ECDSA_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_ECDSA_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_ECDSA_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_ECDSA_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_ECDSA_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_ECDSA_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_ECDSA_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_ECDSA_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_ECDSA_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_ECDSA_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_ECDSA_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_ECDSA_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_KM_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_KM_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x124)
/** CORE1_CORE1_KM_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_KM_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_KM_INT_MAP_M  (CORE1_CORE1_KM_INT_MAP_V << CORE1_CORE1_KM_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_KM_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_KM_INT_MAP_S  0
/** CORE1_CORE1_KM_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_KM_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_KM_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_KM_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_KM_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_KM_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_KM_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_KM_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_KM_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_KM_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_KM_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_KM_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_KM_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_KM_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_GPIO_INT0_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_GPIO_INT0_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x128)
/** CORE1_CORE1_GPIO_INT0_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_GPIO_INT0_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_GPIO_INT0_MAP_M  (CORE1_CORE1_GPIO_INT0_MAP_V << CORE1_CORE1_GPIO_INT0_MAP_S)
#define INTERRUPT_CORE1_CORE1_GPIO_INT0_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_GPIO_INT0_MAP_S  0
/** CORE1_CORE1_GPIO_INT0_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_GPIO_INT0_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_GPIO_INT0_SRC_PASS_IN_SEC_M  (CORE1_CORE1_GPIO_INT0_SRC_PASS_IN_SEC_V << CORE1_CORE1_GPIO_INT0_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_GPIO_INT0_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_GPIO_INT0_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_GPIO_INT0_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_GPIO_INT0_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_GPIO_INT0_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_GPIO_INT0_SRC_IN_SEC_FLAG_V << CORE1_CORE1_GPIO_INT0_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_GPIO_INT0_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_GPIO_INT0_SRC_IN_SEC_FLAG_S  7

/** CORE1_GPIO_INT1_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_GPIO_INT1_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x12c)
/** CORE1_CORE1_GPIO_INT1_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_GPIO_INT1_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_GPIO_INT1_MAP_M  (CORE1_CORE1_GPIO_INT1_MAP_V << CORE1_CORE1_GPIO_INT1_MAP_S)
#define INTERRUPT_CORE1_CORE1_GPIO_INT1_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_GPIO_INT1_MAP_S  0
/** CORE1_CORE1_GPIO_INT1_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_GPIO_INT1_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_GPIO_INT1_SRC_PASS_IN_SEC_M  (CORE1_CORE1_GPIO_INT1_SRC_PASS_IN_SEC_V << CORE1_CORE1_GPIO_INT1_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_GPIO_INT1_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_GPIO_INT1_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_GPIO_INT1_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_GPIO_INT1_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_GPIO_INT1_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_GPIO_INT1_SRC_IN_SEC_FLAG_V << CORE1_CORE1_GPIO_INT1_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_GPIO_INT1_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_GPIO_INT1_SRC_IN_SEC_FLAG_S  7

