espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/interrupt_core1_reg.h
/** CORE1_GPIO_INT2_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_GPIO_INT2_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x130)
/** CORE1_CORE1_GPIO_INT2_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_GPIO_INT2_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_GPIO_INT2_MAP_M  (CORE1_CORE1_GPIO_INT2_MAP_V << CORE1_CORE1_GPIO_INT2_MAP_S)
#define INTERRUPT_CORE1_CORE1_GPIO_INT2_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_GPIO_INT2_MAP_S  0
/** CORE1_CORE1_GPIO_INT2_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_GPIO_INT2_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_GPIO_INT2_SRC_PASS_IN_SEC_M  (CORE1_CORE1_GPIO_INT2_SRC_PASS_IN_SEC_V << CORE1_CORE1_GPIO_INT2_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_GPIO_INT2_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_GPIO_INT2_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_GPIO_INT2_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_GPIO_INT2_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_GPIO_INT2_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_GPIO_INT2_SRC_IN_SEC_FLAG_V << CORE1_CORE1_GPIO_INT2_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_GPIO_INT2_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_GPIO_INT2_SRC_IN_SEC_FLAG_S  7

/** CORE1_GPIO_INT3_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_GPIO_INT3_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x134)
/** CORE1_CORE1_GPIO_INT3_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_GPIO_INT3_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_GPIO_INT3_MAP_M  (CORE1_CORE1_GPIO_INT3_MAP_V << CORE1_CORE1_GPIO_INT3_MAP_S)
#define INTERRUPT_CORE1_CORE1_GPIO_INT3_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_GPIO_INT3_MAP_S  0
/** CORE1_CORE1_GPIO_INT3_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_GPIO_INT3_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_GPIO_INT3_SRC_PASS_IN_SEC_M  (CORE1_CORE1_GPIO_INT3_SRC_PASS_IN_SEC_V << CORE1_CORE1_GPIO_INT3_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_GPIO_INT3_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_GPIO_INT3_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_GPIO_INT3_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_GPIO_INT3_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_GPIO_INT3_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_GPIO_INT3_SRC_IN_SEC_FLAG_V << CORE1_CORE1_GPIO_INT3_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_GPIO_INT3_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_GPIO_INT3_SRC_IN_SEC_FLAG_S  7

/** CORE1_GPIO_PAD_COMP_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_GPIO_PAD_COMP_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x138)
/** CORE1_CORE1_GPIO_PAD_COMP_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_GPIO_PAD_COMP_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_GPIO_PAD_COMP_INT_MAP_M  (CORE1_CORE1_GPIO_PAD_COMP_INT_MAP_V << CORE1_CORE1_GPIO_PAD_COMP_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_GPIO_PAD_COMP_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_GPIO_PAD_COMP_INT_MAP_S  0
/** CORE1_CORE1_GPIO_PAD_COMP_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_GPIO_PAD_COMP_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_GPIO_PAD_COMP_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_GPIO_PAD_COMP_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_GPIO_PAD_COMP_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_GPIO_PAD_COMP_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_GPIO_PAD_COMP_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_GPIO_PAD_COMP_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_GPIO_PAD_COMP_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_GPIO_PAD_COMP_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_GPIO_PAD_COMP_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_GPIO_PAD_COMP_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_GPIO_PAD_COMP_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_GPIO_PAD_COMP_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_CPU_INT_FROM_CPU_0_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_CPU_INT_FROM_CPU_0_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x13c)
/** CORE1_CORE1_CPU_INT_FROM_CPU_0_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_0_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_0_MAP_M  (CORE1_CORE1_CPU_INT_FROM_CPU_0_MAP_V << CORE1_CORE1_CPU_INT_FROM_CPU_0_MAP_S)
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_0_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_0_MAP_S  0
/** CORE1_CORE1_CPU_INT_FROM_CPU_0_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_0_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_0_SRC_PASS_IN_SEC_M  (CORE1_CORE1_CPU_INT_FROM_CPU_0_SRC_PASS_IN_SEC_V << CORE1_CORE1_CPU_INT_FROM_CPU_0_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_0_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_0_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_CPU_INT_FROM_CPU_0_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_0_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_0_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_CPU_INT_FROM_CPU_0_SRC_IN_SEC_FLAG_V << CORE1_CORE1_CPU_INT_FROM_CPU_0_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_0_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_0_SRC_IN_SEC_FLAG_S  7

/** CORE1_CPU_INT_FROM_CPU_1_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_CPU_INT_FROM_CPU_1_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x140)
/** CORE1_CORE1_CPU_INT_FROM_CPU_1_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_1_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_1_MAP_M  (CORE1_CORE1_CPU_INT_FROM_CPU_1_MAP_V << CORE1_CORE1_CPU_INT_FROM_CPU_1_MAP_S)
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_1_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_1_MAP_S  0
/** CORE1_CORE1_CPU_INT_FROM_CPU_1_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_1_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_1_SRC_PASS_IN_SEC_M  (CORE1_CORE1_CPU_INT_FROM_CPU_1_SRC_PASS_IN_SEC_V << CORE1_CORE1_CPU_INT_FROM_CPU_1_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_1_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_1_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_CPU_INT_FROM_CPU_1_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_1_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_1_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_CPU_INT_FROM_CPU_1_SRC_IN_SEC_FLAG_V << CORE1_CORE1_CPU_INT_FROM_CPU_1_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_1_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_1_SRC_IN_SEC_FLAG_S  7

/** CORE1_CPU_INT_FROM_CPU_2_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_CPU_INT_FROM_CPU_2_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x144)
/** CORE1_CORE1_CPU_INT_FROM_CPU_2_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_2_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_2_MAP_M  (CORE1_CORE1_CPU_INT_FROM_CPU_2_MAP_V << CORE1_CORE1_CPU_INT_FROM_CPU_2_MAP_S)
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_2_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_2_MAP_S  0
/** CORE1_CORE1_CPU_INT_FROM_CPU_2_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_2_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_2_SRC_PASS_IN_SEC_M  (CORE1_CORE1_CPU_INT_FROM_CPU_2_SRC_PASS_IN_SEC_V << CORE1_CORE1_CPU_INT_FROM_CPU_2_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_2_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_2_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_CPU_INT_FROM_CPU_2_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_2_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_2_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_CPU_INT_FROM_CPU_2_SRC_IN_SEC_FLAG_V << CORE1_CORE1_CPU_INT_FROM_CPU_2_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_2_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_2_SRC_IN_SEC_FLAG_S  7

/** CORE1_CPU_INT_FROM_CPU_3_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_CPU_INT_FROM_CPU_3_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x148)
/** CORE1_CORE1_CPU_INT_FROM_CPU_3_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_3_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_3_MAP_M  (CORE1_CORE1_CPU_INT_FROM_CPU_3_MAP_V << CORE1_CORE1_CPU_INT_FROM_CPU_3_MAP_S)
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_3_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_3_MAP_S  0
/** CORE1_CORE1_CPU_INT_FROM_CPU_3_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_3_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_3_SRC_PASS_IN_SEC_M  (CORE1_CORE1_CPU_INT_FROM_CPU_3_SRC_PASS_IN_SEC_V << CORE1_CORE1_CPU_INT_FROM_CPU_3_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_3_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_3_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_CPU_INT_FROM_CPU_3_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_3_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_3_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_CPU_INT_FROM_CPU_3_SRC_IN_SEC_FLAG_V << CORE1_CORE1_CPU_INT_FROM_CPU_3_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_3_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_CPU_INT_FROM_CPU_3_SRC_IN_SEC_FLAG_S  7

/** CORE1_CACHE_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_CACHE_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x14c)
/** CORE1_CORE1_CACHE_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_CACHE_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_CACHE_INT_MAP_M  (CORE1_CORE1_CACHE_INT_MAP_V << CORE1_CORE1_CACHE_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_CACHE_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_CACHE_INT_MAP_S  0
/** CORE1_CORE1_CACHE_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_CACHE_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_CACHE_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_CACHE_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_CACHE_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_CACHE_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_CACHE_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_CACHE_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_CACHE_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_CACHE_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_CACHE_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_CACHE_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_CACHE_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_CACHE_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_FLASH_MSPI_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_FLASH_MSPI_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x150)
/** CORE1_CORE1_FLASH_MSPI_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_FLASH_MSPI_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_FLASH_MSPI_INT_MAP_M  (CORE1_CORE1_FLASH_MSPI_INT_MAP_V << CORE1_CORE1_FLASH_MSPI_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_FLASH_MSPI_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_FLASH_MSPI_INT_MAP_S  0
/** CORE1_CORE1_FLASH_MSPI_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_FLASH_MSPI_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_FLASH_MSPI_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_FLASH_MSPI_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_FLASH_MSPI_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_FLASH_MSPI_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_FLASH_MSPI_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_FLASH_MSPI_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_FLASH_MSPI_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_FLASH_MSPI_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_FLASH_MSPI_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_FLASH_MSPI_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_FLASH_MSPI_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_FLASH_MSPI_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_CSI_BRIDGE_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_CSI_BRIDGE_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x154)
/** CORE1_CORE1_CSI_BRIDGE_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_CSI_BRIDGE_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_CSI_BRIDGE_INT_MAP_M  (CORE1_CORE1_CSI_BRIDGE_INT_MAP_V << CORE1_CORE1_CSI_BRIDGE_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_CSI_BRIDGE_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_CSI_BRIDGE_INT_MAP_S  0
/** CORE1_CORE1_CSI_BRIDGE_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_CSI_BRIDGE_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_CSI_BRIDGE_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_CSI_BRIDGE_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_CSI_BRIDGE_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_CSI_BRIDGE_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_CSI_BRIDGE_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_CSI_BRIDGE_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_CSI_BRIDGE_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_CSI_BRIDGE_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_CSI_BRIDGE_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_CSI_BRIDGE_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_CSI_BRIDGE_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_CSI_BRIDGE_INT_SRC_IN_SEC_FLAG_S  7

