espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/interrupt_core1_reg.h
/** CORE1_USB_OTG_ENDP_MULTI_PROC_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_USB_OTG_ENDP_MULTI_PROC_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x178)
/** CORE1_CORE1_USB_OTG_ENDP_MULTI_PROC_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_USB_OTG_ENDP_MULTI_PROC_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_USB_OTG_ENDP_MULTI_PROC_INT_MAP_M  (CORE1_CORE1_USB_OTG_ENDP_MULTI_PROC_INT_MAP_V << CORE1_CORE1_USB_OTG_ENDP_MULTI_PROC_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_USB_OTG_ENDP_MULTI_PROC_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_USB_OTG_ENDP_MULTI_PROC_INT_MAP_S  0
/** CORE1_CORE1_USB_OTG_ENDP_MULTI_PROC_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6];
 *  default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_USB_OTG_ENDP_MULTI_PROC_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_USB_OTG_ENDP_MULTI_PROC_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_USB_OTG_ENDP_MULTI_PROC_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_USB_OTG_ENDP_MULTI_PROC_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_USB_OTG_ENDP_MULTI_PROC_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_USB_OTG_ENDP_MULTI_PROC_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_USB_OTG_ENDP_MULTI_PROC_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7];
 *  default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_USB_OTG_ENDP_MULTI_PROC_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_USB_OTG_ENDP_MULTI_PROC_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_USB_OTG_ENDP_MULTI_PROC_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_USB_OTG_ENDP_MULTI_PROC_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_USB_OTG_ENDP_MULTI_PROC_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_USB_OTG_ENDP_MULTI_PROC_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_JPEG_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_JPEG_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x17c)
/** CORE1_CORE1_JPEG_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_JPEG_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_JPEG_INT_MAP_M  (CORE1_CORE1_JPEG_INT_MAP_V << CORE1_CORE1_JPEG_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_JPEG_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_JPEG_INT_MAP_S  0
/** CORE1_CORE1_JPEG_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_JPEG_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_JPEG_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_JPEG_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_JPEG_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_JPEG_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_JPEG_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_JPEG_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_JPEG_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_JPEG_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_JPEG_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_JPEG_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_JPEG_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_JPEG_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_PPA_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_PPA_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x180)
/** CORE1_CORE1_PPA_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_PPA_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_PPA_INT_MAP_M  (CORE1_CORE1_PPA_INT_MAP_V << CORE1_CORE1_PPA_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_PPA_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_PPA_INT_MAP_S  0
/** CORE1_CORE1_PPA_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_PPA_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_PPA_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_PPA_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_PPA_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_PPA_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_PPA_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_PPA_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_PPA_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_PPA_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_PPA_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_PPA_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_PPA_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_PPA_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_CORE0_TRACE_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_CORE0_TRACE_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x184)
/** CORE1_CORE1_CORE0_TRACE_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_CORE0_TRACE_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_CORE0_TRACE_INT_MAP_M  (CORE1_CORE1_CORE0_TRACE_INT_MAP_V << CORE1_CORE1_CORE0_TRACE_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_CORE0_TRACE_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_CORE0_TRACE_INT_MAP_S  0
/** CORE1_CORE1_CORE0_TRACE_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_CORE0_TRACE_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_CORE0_TRACE_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_CORE0_TRACE_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_CORE0_TRACE_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_CORE0_TRACE_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_CORE0_TRACE_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_CORE0_TRACE_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_CORE0_TRACE_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_CORE0_TRACE_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_CORE0_TRACE_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_CORE0_TRACE_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_CORE0_TRACE_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_CORE0_TRACE_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_CORE1_TRACE_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_TRACE_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x188)
/** CORE1_CORE1_CORE1_TRACE_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_CORE1_TRACE_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_CORE1_TRACE_INT_MAP_M  (CORE1_CORE1_CORE1_TRACE_INT_MAP_V << CORE1_CORE1_CORE1_TRACE_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_CORE1_TRACE_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_CORE1_TRACE_INT_MAP_S  0
/** CORE1_CORE1_CORE1_TRACE_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_CORE1_TRACE_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_CORE1_TRACE_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_CORE1_TRACE_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_CORE1_TRACE_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_CORE1_TRACE_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_CORE1_TRACE_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_CORE1_TRACE_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_CORE1_TRACE_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_CORE1_TRACE_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_CORE1_TRACE_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_CORE1_TRACE_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_CORE1_TRACE_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_CORE1_TRACE_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_HP_CORE_CTRL_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_HP_CORE_CTRL_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x18c)
/** CORE1_CORE1_HP_CORE_CTRL_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_HP_CORE_CTRL_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_HP_CORE_CTRL_INT_MAP_M  (CORE1_CORE1_HP_CORE_CTRL_INT_MAP_V << CORE1_CORE1_HP_CORE_CTRL_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_HP_CORE_CTRL_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_HP_CORE_CTRL_INT_MAP_S  0
/** CORE1_CORE1_HP_CORE_CTRL_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_HP_CORE_CTRL_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_HP_CORE_CTRL_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_HP_CORE_CTRL_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_HP_CORE_CTRL_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_HP_CORE_CTRL_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_HP_CORE_CTRL_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_HP_CORE_CTRL_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_HP_CORE_CTRL_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_HP_CORE_CTRL_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_HP_CORE_CTRL_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_HP_CORE_CTRL_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_HP_CORE_CTRL_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_HP_CORE_CTRL_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_ISP_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_ISP_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x190)
/** CORE1_CORE1_ISP_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_ISP_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_ISP_INT_MAP_M  (CORE1_CORE1_ISP_INT_MAP_V << CORE1_CORE1_ISP_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_ISP_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_ISP_INT_MAP_S  0
/** CORE1_CORE1_ISP_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_ISP_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_ISP_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_ISP_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_ISP_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_ISP_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_ISP_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_ISP_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_ISP_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_ISP_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_ISP_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_ISP_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_ISP_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_ISP_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_I3C_MST_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_I3C_MST_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x194)
/** CORE1_CORE1_I3C_MST_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_I3C_MST_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_I3C_MST_INT_MAP_M  (CORE1_CORE1_I3C_MST_INT_MAP_V << CORE1_CORE1_I3C_MST_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_I3C_MST_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_I3C_MST_INT_MAP_S  0
/** CORE1_CORE1_I3C_MST_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_I3C_MST_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_I3C_MST_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_I3C_MST_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_I3C_MST_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_I3C_MST_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_I3C_MST_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_I3C_MST_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_I3C_MST_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_I3C_MST_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_I3C_MST_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_I3C_MST_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_I3C_MST_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_I3C_MST_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_I3C_SLV_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_I3C_SLV_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x198)
/** CORE1_CORE1_I3C_SLV_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_I3C_SLV_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_I3C_SLV_INT_MAP_M  (CORE1_CORE1_I3C_SLV_INT_MAP_V << CORE1_CORE1_I3C_SLV_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_I3C_SLV_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_I3C_SLV_INT_MAP_S  0
/** CORE1_CORE1_I3C_SLV_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_I3C_SLV_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_I3C_SLV_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_I3C_SLV_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_I3C_SLV_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_I3C_SLV_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_I3C_SLV_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_I3C_SLV_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_I3C_SLV_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_I3C_SLV_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_I3C_SLV_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_I3C_SLV_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_I3C_SLV_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_I3C_SLV_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_USB_OTG11_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_USB_OTG11_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x19c)
/** CORE1_CORE1_USB_OTG11_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_USB_OTG11_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_USB_OTG11_INT_MAP_M  (CORE1_CORE1_USB_OTG11_INT_MAP_V << CORE1_CORE1_USB_OTG11_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_USB_OTG11_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_USB_OTG11_INT_MAP_S  0
/** CORE1_CORE1_USB_OTG11_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_USB_OTG11_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_USB_OTG11_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_USB_OTG11_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_USB_OTG11_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_USB_OTG11_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_USB_OTG11_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_USB_OTG11_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_USB_OTG11_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_USB_OTG11_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_USB_OTG11_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_USB_OTG11_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_USB_OTG11_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_USB_OTG11_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_DMA2D_IN_CH0_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_DMA2D_IN_CH0_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1a0)
/** CORE1_CORE1_DMA2D_IN_CH0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_DMA2D_IN_CH0_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_DMA2D_IN_CH0_INT_MAP_M  (CORE1_CORE1_DMA2D_IN_CH0_INT_MAP_V << CORE1_CORE1_DMA2D_IN_CH0_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_DMA2D_IN_CH0_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_DMA2D_IN_CH0_INT_MAP_S  0
/** CORE1_CORE1_DMA2D_IN_CH0_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_DMA2D_IN_CH0_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_DMA2D_IN_CH0_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_DMA2D_IN_CH0_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_DMA2D_IN_CH0_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_DMA2D_IN_CH0_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_DMA2D_IN_CH0_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_DMA2D_IN_CH0_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_DMA2D_IN_CH0_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_DMA2D_IN_CH0_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_DMA2D_IN_CH0_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_DMA2D_IN_CH0_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_DMA2D_IN_CH0_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_DMA2D_IN_CH0_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_DMA2D_IN_CH1_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_DMA2D_IN_CH1_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1a4)
/** CORE1_CORE1_DMA2D_IN_CH1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_DMA2D_IN_CH1_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_DMA2D_IN_CH1_INT_MAP_M  (CORE1_CORE1_DMA2D_IN_CH1_INT_MAP_V << CORE1_CORE1_DMA2D_IN_CH1_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_DMA2D_IN_CH1_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_DMA2D_IN_CH1_INT_MAP_S  0
/** CORE1_CORE1_DMA2D_IN_CH1_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_DMA2D_IN_CH1_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_DMA2D_IN_CH1_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_DMA2D_IN_CH1_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_DMA2D_IN_CH1_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_DMA2D_IN_CH1_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_DMA2D_IN_CH1_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_DMA2D_IN_CH1_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_DMA2D_IN_CH1_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_DMA2D_IN_CH1_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_DMA2D_IN_CH1_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_DMA2D_IN_CH1_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_DMA2D_IN_CH1_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_DMA2D_IN_CH1_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_DMA2D_OUT_CH0_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_DMA2D_OUT_CH0_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1a8)
/** CORE1_CORE1_DMA2D_OUT_CH0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH0_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH0_INT_MAP_M  (CORE1_CORE1_DMA2D_OUT_CH0_INT_MAP_V << CORE1_CORE1_DMA2D_OUT_CH0_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH0_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH0_INT_MAP_S  0
/** CORE1_CORE1_DMA2D_OUT_CH0_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH0_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH0_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_DMA2D_OUT_CH0_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_DMA2D_OUT_CH0_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH0_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH0_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_DMA2D_OUT_CH0_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH0_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH0_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_DMA2D_OUT_CH0_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_DMA2D_OUT_CH0_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH0_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH0_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_DMA2D_OUT_CH1_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_DMA2D_OUT_CH1_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1ac)
/** CORE1_CORE1_DMA2D_OUT_CH1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH1_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH1_INT_MAP_M  (CORE1_CORE1_DMA2D_OUT_CH1_INT_MAP_V << CORE1_CORE1_DMA2D_OUT_CH1_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH1_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH1_INT_MAP_S  0
/** CORE1_CORE1_DMA2D_OUT_CH1_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH1_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH1_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_DMA2D_OUT_CH1_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_DMA2D_OUT_CH1_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH1_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH1_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_DMA2D_OUT_CH1_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH1_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH1_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_DMA2D_OUT_CH1_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_DMA2D_OUT_CH1_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH1_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH1_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_DMA2D_OUT_CH2_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_DMA2D_OUT_CH2_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1b0)
/** CORE1_CORE1_DMA2D_OUT_CH2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH2_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH2_INT_MAP_M  (CORE1_CORE1_DMA2D_OUT_CH2_INT_MAP_V << CORE1_CORE1_DMA2D_OUT_CH2_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH2_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH2_INT_MAP_S  0
/** CORE1_CORE1_DMA2D_OUT_CH2_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH2_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH2_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_DMA2D_OUT_CH2_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_DMA2D_OUT_CH2_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH2_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH2_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_DMA2D_OUT_CH2_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH2_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH2_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_DMA2D_OUT_CH2_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_DMA2D_OUT_CH2_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH2_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH2_INT_SRC_IN_SEC_FLAG_S  7

