espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/interrupt_core1_reg.h
/** CORE1_PSRAM_MSPI_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_PSRAM_MSPI_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1b4)
/** CORE1_CORE1_PSRAM_MSPI_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_PSRAM_MSPI_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_PSRAM_MSPI_INT_MAP_M  (CORE1_CORE1_PSRAM_MSPI_INT_MAP_V << CORE1_CORE1_PSRAM_MSPI_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_PSRAM_MSPI_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_PSRAM_MSPI_INT_MAP_S  0
/** CORE1_CORE1_PSRAM_MSPI_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_PSRAM_MSPI_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_PSRAM_MSPI_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_PSRAM_MSPI_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_PSRAM_MSPI_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_PSRAM_MSPI_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_PSRAM_MSPI_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_PSRAM_MSPI_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_PSRAM_MSPI_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_PSRAM_MSPI_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_PSRAM_MSPI_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_PSRAM_MSPI_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_PSRAM_MSPI_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_PSRAM_MSPI_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_HP_SYSREG_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_HP_SYSREG_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1b8)
/** CORE1_CORE1_HP_SYSREG_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_HP_SYSREG_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_HP_SYSREG_INT_MAP_M  (CORE1_CORE1_HP_SYSREG_INT_MAP_V << CORE1_CORE1_HP_SYSREG_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_HP_SYSREG_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_HP_SYSREG_INT_MAP_S  0
/** CORE1_CORE1_HP_SYSREG_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_HP_SYSREG_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_HP_SYSREG_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_HP_SYSREG_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_HP_SYSREG_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_HP_SYSREG_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_HP_SYSREG_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_HP_SYSREG_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_HP_SYSREG_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_HP_SYSREG_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_HP_SYSREG_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_HP_SYSREG_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_HP_SYSREG_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_HP_SYSREG_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_PCNT_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_PCNT_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1bc)
/** CORE1_CORE1_PCNT_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_PCNT_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_PCNT_INT_MAP_M  (CORE1_CORE1_PCNT_INT_MAP_V << CORE1_CORE1_PCNT_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_PCNT_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_PCNT_INT_MAP_S  0
/** CORE1_CORE1_PCNT_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_PCNT_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_PCNT_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_PCNT_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_PCNT_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_PCNT_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_PCNT_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_PCNT_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_PCNT_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_PCNT_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_PCNT_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_PCNT_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_PCNT_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_PCNT_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_HP_PAU_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_HP_PAU_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1c0)
/** CORE1_CORE1_HP_PAU_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_HP_PAU_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_HP_PAU_INT_MAP_M  (CORE1_CORE1_HP_PAU_INT_MAP_V << CORE1_CORE1_HP_PAU_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_HP_PAU_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_HP_PAU_INT_MAP_S  0
/** CORE1_CORE1_HP_PAU_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_HP_PAU_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_HP_PAU_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_HP_PAU_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_HP_PAU_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_HP_PAU_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_HP_PAU_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_HP_PAU_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_HP_PAU_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_HP_PAU_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_HP_PAU_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_HP_PAU_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_HP_PAU_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_HP_PAU_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_HP_PARLIO_RX_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_HP_PARLIO_RX_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1c4)
/** CORE1_CORE1_HP_PARLIO_RX_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_HP_PARLIO_RX_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_HP_PARLIO_RX_INT_MAP_M  (CORE1_CORE1_HP_PARLIO_RX_INT_MAP_V << CORE1_CORE1_HP_PARLIO_RX_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_HP_PARLIO_RX_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_HP_PARLIO_RX_INT_MAP_S  0
/** CORE1_CORE1_HP_PARLIO_RX_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_HP_PARLIO_RX_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_HP_PARLIO_RX_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_HP_PARLIO_RX_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_HP_PARLIO_RX_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_HP_PARLIO_RX_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_HP_PARLIO_RX_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_HP_PARLIO_RX_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_HP_PARLIO_RX_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_HP_PARLIO_RX_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_HP_PARLIO_RX_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_HP_PARLIO_RX_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_HP_PARLIO_RX_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_HP_PARLIO_RX_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_HP_PARLIO_TX_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_HP_PARLIO_TX_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1c8)
/** CORE1_CORE1_HP_PARLIO_TX_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_HP_PARLIO_TX_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_HP_PARLIO_TX_INT_MAP_M  (CORE1_CORE1_HP_PARLIO_TX_INT_MAP_V << CORE1_CORE1_HP_PARLIO_TX_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_HP_PARLIO_TX_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_HP_PARLIO_TX_INT_MAP_S  0
/** CORE1_CORE1_HP_PARLIO_TX_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_HP_PARLIO_TX_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_HP_PARLIO_TX_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_HP_PARLIO_TX_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_HP_PARLIO_TX_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_HP_PARLIO_TX_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_HP_PARLIO_TX_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_HP_PARLIO_TX_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_HP_PARLIO_TX_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_HP_PARLIO_TX_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_HP_PARLIO_TX_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_HP_PARLIO_TX_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_HP_PARLIO_TX_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_HP_PARLIO_TX_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_H264_DMA2D_OUT_CH0_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_H264_DMA2D_OUT_CH0_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1cc)
/** CORE1_CORE1_H264_DMA2D_OUT_CH0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH0_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH0_INT_MAP_M  (CORE1_CORE1_H264_DMA2D_OUT_CH0_INT_MAP_V << CORE1_CORE1_H264_DMA2D_OUT_CH0_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH0_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH0_INT_MAP_S  0
/** CORE1_CORE1_H264_DMA2D_OUT_CH0_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH0_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH0_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_H264_DMA2D_OUT_CH0_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_H264_DMA2D_OUT_CH0_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH0_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH0_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_H264_DMA2D_OUT_CH0_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH0_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH0_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_H264_DMA2D_OUT_CH0_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_H264_DMA2D_OUT_CH0_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH0_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH0_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_H264_DMA2D_OUT_CH1_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_H264_DMA2D_OUT_CH1_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1d0)
/** CORE1_CORE1_H264_DMA2D_OUT_CH1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH1_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH1_INT_MAP_M  (CORE1_CORE1_H264_DMA2D_OUT_CH1_INT_MAP_V << CORE1_CORE1_H264_DMA2D_OUT_CH1_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH1_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH1_INT_MAP_S  0
/** CORE1_CORE1_H264_DMA2D_OUT_CH1_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH1_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH1_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_H264_DMA2D_OUT_CH1_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_H264_DMA2D_OUT_CH1_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH1_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH1_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_H264_DMA2D_OUT_CH1_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH1_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH1_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_H264_DMA2D_OUT_CH1_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_H264_DMA2D_OUT_CH1_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH1_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH1_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_H264_DMA2D_OUT_CH2_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_H264_DMA2D_OUT_CH2_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1d4)
/** CORE1_CORE1_H264_DMA2D_OUT_CH2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH2_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH2_INT_MAP_M  (CORE1_CORE1_H264_DMA2D_OUT_CH2_INT_MAP_V << CORE1_CORE1_H264_DMA2D_OUT_CH2_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH2_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH2_INT_MAP_S  0
/** CORE1_CORE1_H264_DMA2D_OUT_CH2_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH2_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH2_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_H264_DMA2D_OUT_CH2_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_H264_DMA2D_OUT_CH2_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH2_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH2_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_H264_DMA2D_OUT_CH2_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH2_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH2_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_H264_DMA2D_OUT_CH2_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_H264_DMA2D_OUT_CH2_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH2_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH2_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_H264_DMA2D_OUT_CH3_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_H264_DMA2D_OUT_CH3_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1d8)
/** CORE1_CORE1_H264_DMA2D_OUT_CH3_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH3_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH3_INT_MAP_M  (CORE1_CORE1_H264_DMA2D_OUT_CH3_INT_MAP_V << CORE1_CORE1_H264_DMA2D_OUT_CH3_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH3_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH3_INT_MAP_S  0
/** CORE1_CORE1_H264_DMA2D_OUT_CH3_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH3_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH3_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_H264_DMA2D_OUT_CH3_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_H264_DMA2D_OUT_CH3_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH3_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH3_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_H264_DMA2D_OUT_CH3_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH3_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH3_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_H264_DMA2D_OUT_CH3_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_H264_DMA2D_OUT_CH3_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH3_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH3_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_H264_DMA2D_OUT_CH4_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_H264_DMA2D_OUT_CH4_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1dc)
/** CORE1_CORE1_H264_DMA2D_OUT_CH4_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH4_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH4_INT_MAP_M  (CORE1_CORE1_H264_DMA2D_OUT_CH4_INT_MAP_V << CORE1_CORE1_H264_DMA2D_OUT_CH4_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH4_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH4_INT_MAP_S  0
/** CORE1_CORE1_H264_DMA2D_OUT_CH4_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH4_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH4_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_H264_DMA2D_OUT_CH4_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_H264_DMA2D_OUT_CH4_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH4_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH4_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_H264_DMA2D_OUT_CH4_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH4_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH4_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_H264_DMA2D_OUT_CH4_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_H264_DMA2D_OUT_CH4_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH4_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_OUT_CH4_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_H264_DMA2D_IN_CH0_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_H264_DMA2D_IN_CH0_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1e0)
/** CORE1_CORE1_H264_DMA2D_IN_CH0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH0_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH0_INT_MAP_M  (CORE1_CORE1_H264_DMA2D_IN_CH0_INT_MAP_V << CORE1_CORE1_H264_DMA2D_IN_CH0_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH0_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH0_INT_MAP_S  0
/** CORE1_CORE1_H264_DMA2D_IN_CH0_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH0_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH0_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_H264_DMA2D_IN_CH0_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_H264_DMA2D_IN_CH0_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH0_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH0_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_H264_DMA2D_IN_CH0_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH0_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH0_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_H264_DMA2D_IN_CH0_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_H264_DMA2D_IN_CH0_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH0_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH0_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_H264_DMA2D_IN_CH1_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_H264_DMA2D_IN_CH1_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1e4)
/** CORE1_CORE1_H264_DMA2D_IN_CH1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH1_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH1_INT_MAP_M  (CORE1_CORE1_H264_DMA2D_IN_CH1_INT_MAP_V << CORE1_CORE1_H264_DMA2D_IN_CH1_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH1_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH1_INT_MAP_S  0
/** CORE1_CORE1_H264_DMA2D_IN_CH1_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH1_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH1_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_H264_DMA2D_IN_CH1_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_H264_DMA2D_IN_CH1_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH1_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH1_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_H264_DMA2D_IN_CH1_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH1_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH1_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_H264_DMA2D_IN_CH1_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_H264_DMA2D_IN_CH1_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH1_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH1_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_H264_DMA2D_IN_CH2_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_H264_DMA2D_IN_CH2_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1e8)
/** CORE1_CORE1_H264_DMA2D_IN_CH2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH2_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH2_INT_MAP_M  (CORE1_CORE1_H264_DMA2D_IN_CH2_INT_MAP_V << CORE1_CORE1_H264_DMA2D_IN_CH2_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH2_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH2_INT_MAP_S  0
/** CORE1_CORE1_H264_DMA2D_IN_CH2_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH2_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH2_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_H264_DMA2D_IN_CH2_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_H264_DMA2D_IN_CH2_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH2_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH2_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_H264_DMA2D_IN_CH2_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH2_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH2_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_H264_DMA2D_IN_CH2_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_H264_DMA2D_IN_CH2_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH2_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH2_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_H264_DMA2D_IN_CH3_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_H264_DMA2D_IN_CH3_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1ec)
/** CORE1_CORE1_H264_DMA2D_IN_CH3_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH3_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH3_INT_MAP_M  (CORE1_CORE1_H264_DMA2D_IN_CH3_INT_MAP_V << CORE1_CORE1_H264_DMA2D_IN_CH3_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH3_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH3_INT_MAP_S  0
/** CORE1_CORE1_H264_DMA2D_IN_CH3_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH3_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH3_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_H264_DMA2D_IN_CH3_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_H264_DMA2D_IN_CH3_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH3_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH3_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_H264_DMA2D_IN_CH3_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH3_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH3_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_H264_DMA2D_IN_CH3_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_H264_DMA2D_IN_CH3_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH3_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH3_INT_SRC_IN_SEC_FLAG_S  7

