espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/interrupt_core1_reg.h
/** CORE1_H264_DMA2D_IN_CH4_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_H264_DMA2D_IN_CH4_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1f0)
/** CORE1_CORE1_H264_DMA2D_IN_CH4_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH4_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH4_INT_MAP_M  (CORE1_CORE1_H264_DMA2D_IN_CH4_INT_MAP_V << CORE1_CORE1_H264_DMA2D_IN_CH4_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH4_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH4_INT_MAP_S  0
/** CORE1_CORE1_H264_DMA2D_IN_CH4_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH4_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH4_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_H264_DMA2D_IN_CH4_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_H264_DMA2D_IN_CH4_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH4_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH4_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_H264_DMA2D_IN_CH4_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH4_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH4_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_H264_DMA2D_IN_CH4_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_H264_DMA2D_IN_CH4_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH4_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH4_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_H264_DMA2D_IN_CH5_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_H264_DMA2D_IN_CH5_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1f4)
/** CORE1_CORE1_H264_DMA2D_IN_CH5_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH5_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH5_INT_MAP_M  (CORE1_CORE1_H264_DMA2D_IN_CH5_INT_MAP_V << CORE1_CORE1_H264_DMA2D_IN_CH5_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH5_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH5_INT_MAP_S  0
/** CORE1_CORE1_H264_DMA2D_IN_CH5_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH5_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH5_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_H264_DMA2D_IN_CH5_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_H264_DMA2D_IN_CH5_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH5_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH5_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_H264_DMA2D_IN_CH5_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH5_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH5_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_H264_DMA2D_IN_CH5_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_H264_DMA2D_IN_CH5_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH5_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_H264_DMA2D_IN_CH5_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_H264_REG_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_H264_REG_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1f8)
/** CORE1_CORE1_H264_REG_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_H264_REG_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_H264_REG_INT_MAP_M  (CORE1_CORE1_H264_REG_INT_MAP_V << CORE1_CORE1_H264_REG_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_H264_REG_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_H264_REG_INT_MAP_S  0
/** CORE1_CORE1_H264_REG_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_H264_REG_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_H264_REG_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_H264_REG_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_H264_REG_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_H264_REG_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_H264_REG_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_H264_REG_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_H264_REG_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_H264_REG_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_H264_REG_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_H264_REG_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_H264_REG_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_H264_REG_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_ASSIST_DEBUG_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_ASSIST_DEBUG_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1fc)
/** CORE1_CORE1_ASSIST_DEBUG_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_ASSIST_DEBUG_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_ASSIST_DEBUG_INT_MAP_M  (CORE1_CORE1_ASSIST_DEBUG_INT_MAP_V << CORE1_CORE1_ASSIST_DEBUG_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_ASSIST_DEBUG_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_ASSIST_DEBUG_INT_MAP_S  0
/** CORE1_CORE1_ASSIST_DEBUG_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_ASSIST_DEBUG_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_ASSIST_DEBUG_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_ASSIST_DEBUG_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_ASSIST_DEBUG_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_ASSIST_DEBUG_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_ASSIST_DEBUG_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_ASSIST_DEBUG_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_ASSIST_DEBUG_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_ASSIST_DEBUG_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_ASSIST_DEBUG_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_ASSIST_DEBUG_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_ASSIST_DEBUG_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_ASSIST_DEBUG_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_INTR_STATUS_REG_0_REG register
 *  NA
 */
#define INTERRUPT_CORE1_INTR_STATUS_REG_0_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x200)
/** CORE1_CORE1_INTR_STATUS_0 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_INTR_STATUS_0    0xFFFFFFFFU
#define INTERRUPT_CORE1_CORE1_INTR_STATUS_0_M  (CORE1_CORE1_INTR_STATUS_0_V << CORE1_CORE1_INTR_STATUS_0_S)
#define INTERRUPT_CORE1_CORE1_INTR_STATUS_0_V  0xFFFFFFFFU
#define INTERRUPT_CORE1_CORE1_INTR_STATUS_0_S  0

/** CORE1_INTR_STATUS_REG_1_REG register
 *  NA
 */
#define INTERRUPT_CORE1_INTR_STATUS_REG_1_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x204)
/** CORE1_CORE1_INTR_STATUS_1 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_INTR_STATUS_1    0xFFFFFFFFU
#define INTERRUPT_CORE1_CORE1_INTR_STATUS_1_M  (CORE1_CORE1_INTR_STATUS_1_V << CORE1_CORE1_INTR_STATUS_1_S)
#define INTERRUPT_CORE1_CORE1_INTR_STATUS_1_V  0xFFFFFFFFU
#define INTERRUPT_CORE1_CORE1_INTR_STATUS_1_S  0

/** CORE1_INTR_STATUS_REG_2_REG register
 *  NA
 */
#define INTERRUPT_CORE1_INTR_STATUS_REG_2_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x208)
/** CORE1_CORE1_INTR_STATUS_2 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_INTR_STATUS_2    0xFFFFFFFFU
#define INTERRUPT_CORE1_CORE1_INTR_STATUS_2_M  (CORE1_CORE1_INTR_STATUS_2_V << CORE1_CORE1_INTR_STATUS_2_S)
#define INTERRUPT_CORE1_CORE1_INTR_STATUS_2_V  0xFFFFFFFFU
#define INTERRUPT_CORE1_CORE1_INTR_STATUS_2_S  0

