espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/interrupt_core1_reg.h
/** CORE1_INTR_STATUS_REG_3_REG register
 *  NA
 */
#define INTERRUPT_CORE1_INTR_STATUS_REG_3_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x20c)
/** CORE1_CORE1_INTR_STATUS_3 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_INTR_STATUS_3    0xFFFFFFFFU
#define INTERRUPT_CORE1_CORE1_INTR_STATUS_3_M  (CORE1_CORE1_INTR_STATUS_3_V << CORE1_CORE1_INTR_STATUS_3_S)
#define INTERRUPT_CORE1_CORE1_INTR_STATUS_3_V  0xFFFFFFFFU
#define INTERRUPT_CORE1_CORE1_INTR_STATUS_3_S  0

/** CORE1_CLOCK_GATE_REG register
 *  NA
 */
#define INTERRUPT_CORE1_CLOCK_GATE_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x210)
/** CORE1_CORE1_REG_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_REG_CLK_EN    (BIT(0))
#define INTERRUPT_CORE1_CORE1_REG_CLK_EN_M  (CORE1_CORE1_REG_CLK_EN_V << CORE1_CORE1_REG_CLK_EN_S)
#define INTERRUPT_CORE1_CORE1_REG_CLK_EN_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_REG_CLK_EN_S  0

/** CORE1_DMA2D_IN_CH2_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_DMA2D_IN_CH2_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x214)
/** CORE1_CORE1_DMA2D_IN_CH2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_DMA2D_IN_CH2_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_DMA2D_IN_CH2_INT_MAP_M  (CORE1_CORE1_DMA2D_IN_CH2_INT_MAP_V << CORE1_CORE1_DMA2D_IN_CH2_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_DMA2D_IN_CH2_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_DMA2D_IN_CH2_INT_MAP_S  0
/** CORE1_CORE1_DMA2D_IN_CH2_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_DMA2D_IN_CH2_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_DMA2D_IN_CH2_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_DMA2D_IN_CH2_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_DMA2D_IN_CH2_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_DMA2D_IN_CH2_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_DMA2D_IN_CH2_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_DMA2D_IN_CH2_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_DMA2D_IN_CH2_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_DMA2D_IN_CH2_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_DMA2D_IN_CH2_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_DMA2D_IN_CH2_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_DMA2D_IN_CH2_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_DMA2D_IN_CH2_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_DMA2D_OUT_CH3_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_DMA2D_OUT_CH3_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x218)
/** CORE1_CORE1_DMA2D_OUT_CH3_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH3_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH3_INT_MAP_M  (CORE1_CORE1_DMA2D_OUT_CH3_INT_MAP_V << CORE1_CORE1_DMA2D_OUT_CH3_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH3_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH3_INT_MAP_S  0
/** CORE1_CORE1_DMA2D_OUT_CH3_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH3_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH3_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_DMA2D_OUT_CH3_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_DMA2D_OUT_CH3_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH3_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH3_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_DMA2D_OUT_CH3_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH3_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH3_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_DMA2D_OUT_CH3_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_DMA2D_OUT_CH3_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH3_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_DMA2D_OUT_CH3_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_AXI_PERF_MON_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE1_AXI_PERF_MON_INT_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x21c)
/** CORE1_CORE1_AXI_PERF_MON_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORE1_AXI_PERF_MON_INT_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORE1_AXI_PERF_MON_INT_MAP_M  (CORE1_CORE1_AXI_PERF_MON_INT_MAP_V << CORE1_CORE1_AXI_PERF_MON_INT_MAP_S)
#define INTERRUPT_CORE1_CORE1_AXI_PERF_MON_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_AXI_PERF_MON_INT_MAP_S  0
/** CORE1_CORE1_AXI_PERF_MON_INT_SRC_PASS_IN_SEC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_AXI_PERF_MON_INT_SRC_PASS_IN_SEC    (BIT(6))
#define INTERRUPT_CORE1_CORE1_AXI_PERF_MON_INT_SRC_PASS_IN_SEC_M  (CORE1_CORE1_AXI_PERF_MON_INT_SRC_PASS_IN_SEC_V << CORE1_CORE1_AXI_PERF_MON_INT_SRC_PASS_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_AXI_PERF_MON_INT_SRC_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_AXI_PERF_MON_INT_SRC_PASS_IN_SEC_S  6
/** CORE1_CORE1_AXI_PERF_MON_INT_SRC_IN_SEC_FLAG : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_AXI_PERF_MON_INT_SRC_IN_SEC_FLAG    (BIT(7))
#define INTERRUPT_CORE1_CORE1_AXI_PERF_MON_INT_SRC_IN_SEC_FLAG_M  (CORE1_CORE1_AXI_PERF_MON_INT_SRC_IN_SEC_FLAG_V << CORE1_CORE1_AXI_PERF_MON_INT_SRC_IN_SEC_FLAG_S)
#define INTERRUPT_CORE1_CORE1_AXI_PERF_MON_INT_SRC_IN_SEC_FLAG_V  0x00000001U
#define INTERRUPT_CORE1_CORE1_AXI_PERF_MON_INT_SRC_IN_SEC_FLAG_S  7

/** CORE1_INTR_STATUS_REG_4_REG register
 *  NA
 */
#define INTERRUPT_CORE1_INTR_STATUS_REG_4_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x220)
/** CORE1_CORE1_INTR_STATUS_4 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_INTR_STATUS_4    0xFFFFFFFFU
#define INTERRUPT_CORE1_CORE1_INTR_STATUS_4_M  (CORE1_CORE1_INTR_STATUS_4_V << CORE1_CORE1_INTR_STATUS_4_S)
#define INTERRUPT_CORE1_CORE1_INTR_STATUS_4_V  0xFFFFFFFFU
#define INTERRUPT_CORE1_CORE1_INTR_STATUS_4_S  0

