espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/interrupt_core1_reg.h
/** CORE1_INTR_SIG_IDX_ASSERT_IN_SEC_REG register
 *  NA
 */
#define INTERRUPT_CORE1_INTR_SIG_IDX_ASSERT_IN_SEC_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x228)
/** CORE1_CORE1_INTR_SIG_IDX_ASSERT_IN_SEC : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_INTR_SIG_IDX_ASSERT_IN_SEC    0x0000003FU
#define INTERRUPT_CORE1_CORE1_INTR_SIG_IDX_ASSERT_IN_SEC_M  (CORE1_CORE1_INTR_SIG_IDX_ASSERT_IN_SEC_V << CORE1_CORE1_INTR_SIG_IDX_ASSERT_IN_SEC_S)
#define INTERRUPT_CORE1_CORE1_INTR_SIG_IDX_ASSERT_IN_SEC_V  0x0000003FU
#define INTERRUPT_CORE1_CORE1_INTR_SIG_IDX_ASSERT_IN_SEC_S  0

/** CORE1_INTR_SEC_STATUS_REG register
 *  NA
 */
#define INTERRUPT_CORE1_INTR_SEC_STATUS_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x22c)
/** CORE1_CORE1_INTR_SEC_STATUS : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_INTR_SEC_STATUS    0xFFFFFFFFU
#define INTERRUPT_CORE1_CORE1_INTR_SEC_STATUS_M  (CORE1_CORE1_INTR_SEC_STATUS_V << CORE1_CORE1_INTR_SEC_STATUS_S)
#define INTERRUPT_CORE1_CORE1_INTR_SEC_STATUS_V  0xFFFFFFFFU
#define INTERRUPT_CORE1_CORE1_INTR_SEC_STATUS_S  0

/** CORE1_INTR_SRC_PASS_IN_SEC_STATUS_0_REG register
 *  NA
 */
#define INTERRUPT_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_0_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x230)
/** CORE1_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_0 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_0    0xFFFFFFFFU
#define INTERRUPT_CORE1_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_0_M  (CORE1_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_0_V << CORE1_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_0_S)
#define INTERRUPT_CORE1_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_0_V  0xFFFFFFFFU
#define INTERRUPT_CORE1_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_0_S  0

/** CORE1_INTR_SRC_PASS_IN_SEC_STATUS_1_REG register
 *  NA
 */
#define INTERRUPT_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_1_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x234)
/** CORE1_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_1 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_1    0xFFFFFFFFU
#define INTERRUPT_CORE1_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_1_M  (CORE1_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_1_V << CORE1_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_1_S)
#define INTERRUPT_CORE1_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_1_V  0xFFFFFFFFU
#define INTERRUPT_CORE1_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_1_S  0

/** CORE1_INTR_SRC_PASS_IN_SEC_STATUS_2_REG register
 *  NA
 */
#define INTERRUPT_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_2_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x238)
/** CORE1_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_2 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_2    0xFFFFFFFFU
#define INTERRUPT_CORE1_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_2_M  (CORE1_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_2_V << CORE1_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_2_S)
#define INTERRUPT_CORE1_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_2_V  0xFFFFFFFFU
#define INTERRUPT_CORE1_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_2_S  0

/** CORE1_INTR_SRC_PASS_IN_SEC_STATUS_3_REG register
 *  NA
 */
#define INTERRUPT_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_3_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x23c)
/** CORE1_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_3 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_3    0xFFFFFFFFU
#define INTERRUPT_CORE1_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_3_M  (CORE1_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_3_V << CORE1_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_3_S)
#define INTERRUPT_CORE1_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_3_V  0xFFFFFFFFU
#define INTERRUPT_CORE1_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_3_S  0

/** CORE1_INTR_SRC_PASS_IN_SEC_STATUS_4_REG register
 *  NA
 */
#define INTERRUPT_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_4_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x240)
/** CORE1_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_4 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_4    0xFFFFFFFFU
#define INTERRUPT_CORE1_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_4_M  (CORE1_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_4_V << CORE1_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_4_S)
#define INTERRUPT_CORE1_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_4_V  0xFFFFFFFFU
#define INTERRUPT_CORE1_CORE1_INTR_SRC_PASS_IN_SEC_STATUS_4_S  0

/** CORE1_INTERRUPT_REG_DATE_REG register
 *  NA
 */
#define INTERRUPT_CORE1_INTERRUPT_REG_DATE_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x3fc)
/** CORE1_CORE1_INTERRUPT_REG_DATE : R/W; bitpos: [27:0]; default: 38806144;
 *  NA
 */
#define INTERRUPT_CORE1_CORE1_INTERRUPT_REG_DATE    0x0FFFFFFFU
#define INTERRUPT_CORE1_CORE1_INTERRUPT_REG_DATE_M  (CORE1_CORE1_INTERRUPT_REG_DATE_V << CORE1_CORE1_INTERRUPT_REG_DATE_S)
#define INTERRUPT_CORE1_CORE1_INTERRUPT_REG_DATE_V  0x0FFFFFFFU
#define INTERRUPT_CORE1_CORE1_INTERRUPT_REG_DATE_S  0

#ifdef __cplusplus
}
#endif
